{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\data\MISSING_MAIN\measures.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Mar 2018, 23:12:37
{txt}
{com}. *Additive scale
. gen Aadded = govjobs + govincdiff
{txt}(5,673 missing values generated)

{com}. factor govjobs govincdiff
{txt}(obs=55,835)

Factor analysis/correlation{col 50}Number of obs    = {res}    55,835
{col 5}{txt}Method: principal factors{col 50}Retained factors =   {res}       1
{col 5}{txt}Rotation: (unrotated){col 50}Number of params =   {res}       1

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}     Factor  {c |} {ralign 12:Eigenvalue}   Difference        Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 11:Factor1}  {c |}{res}      0.74514      0.99513            1.5049       1.5049
{txt}{col 5}{ralign 11:Factor2}  {c |}{res}     -0.24999            .           -0.5049       1.0000
{txt}{col 5}{hline 13}{c BT}{hline 60}
{col 5}LR test: independent vs. saturated:  chi2({res}1{txt})  ={res} 1.6e+04{txt} Prob>chi2 ={res} 0.0000

{txt}Factor loadings (pattern matrix) and unique variances

{space 4}{hline 13}{c  TT}{hline 10}{c  TT}{hline 14}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}{c |}{space 1}{ralign 12:Uniqueness}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{c   +}{hline 14}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.6104}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.6274}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.6104}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.6274}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{c  BT}{hline 14}

{com}. predict Apf
{txt}(regression scoring assumed)

{p 0 0 2}Scoring coefficients (method = regression){p_end}

{space 4}{hline 13}{c  TT}{hline 10}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}
{space 4}{hline 13}{c   +}{hline 10}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.40758}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.40758}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}


{com}. factor govjobs govincdiff, pcf
{txt}(obs=55,835)

Factor analysis/correlation{col 50}Number of obs    = {res}    55,835
{col 5}{txt}Method: principal-component factors{col 50}Retained factors =   {res}       1
{col 5}{txt}Rotation: (unrotated){col 50}Number of params =   {res}       1

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}     Factor  {c |} {ralign 12:Eigenvalue}   Difference        Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 11:Factor1}  {c |}{res}      1.49757      0.99513            0.7488       0.7488
{txt}{col 5}{ralign 11:Factor2}  {c |}{res}      0.50243            .            0.2512       1.0000
{txt}{col 5}{hline 13}{c BT}{hline 60}
{col 5}LR test: independent vs. saturated:  chi2({res}1{txt})  ={res} 1.6e+04{txt} Prob>chi2 ={res} 0.0000

{txt}Factor loadings (pattern matrix) and unique variances

{space 4}{hline 13}{c  TT}{hline 10}{c  TT}{hline 14}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}{c |}{space 1}{ralign 12:Uniqueness}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{c   +}{hline 14}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.8653}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.2512}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.8653}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.2512}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{c  BT}{hline 14}

{com}. predict Apcf
{txt}(regression scoring assumed)

{p 0 0 2}Scoring coefficients (method = regression){p_end}

{space 4}{hline 13}{c  TT}{hline 10}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}
{space 4}{hline 13}{c   +}{hline 10}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.57782}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.57782}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}


{com}. factor govjobs govincdiff, ip
{txt}(obs=55,835)

Factor analysis/correlation{col 50}Number of obs    = {res}    55,835
{col 5}{txt}Method: iterated principal factors{col 50}Retained factors =   {res}       1
{col 5}{txt}Rotation: (unrotated){col 50}Number of params =   {res}       1

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}     Factor  {c |} {ralign 12:Eigenvalue}   Difference        Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 11:Factor1}  {c |}{res}      0.99501      0.99513            1.0001       1.0001
{txt}{col 5}{ralign 11:Factor2}  {c |}{res}     -0.00012            .           -0.0001       1.0000
{txt}{col 5}{hline 13}{c BT}{hline 60}
{col 5}LR test: independent vs. saturated:  chi2({res}1{txt})  ={res} 1.6e+04{txt} Prob>chi2 ={res} 0.0000

{txt}Factor loadings (pattern matrix) and unique variances

{space 4}{hline 13}{c  TT}{hline 10}{c  TT}{hline 14}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}{c |}{space 1}{ralign 12:Uniqueness}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{c   +}{hline 14}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.7053}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.5025}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.7053}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.5025}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{c  BT}{hline 14}

{com}. predict Aip
{txt}(regression scoring assumed)

{p 0 0 2}Scoring coefficients (method = regression){p_end}

{space 4}{hline 13}{c  TT}{hline 10}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}
{space 4}{hline 13}{c   +}{hline 10}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.47099}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.47099}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}


{com}. sum Aadded Apf Apcf Aip

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}Aadded {c |}{res}     55,835    5.816567    1.713636          2          8
{txt}{space 9}Apf {c |}{res}     55,835   -1.32e-09    .7053839  -1.571156    .898874
{txt}{space 8}Apcf {c |}{res}     55,835    4.40e-09           1  -2.227377   1.274305
{txt}{space 9}Aip {c |}{res}     55,835    3.79e-09    .8151187  -1.815576    1.03871
{txt}
{com}. collapse Aadded Apf Apcf Aip, by(id)
{txt}
{com}. sum Aadded Apf Apcf Aip

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}Aadded {c |}{res}         43    5.768484    .6530576   4.332762   6.643272
{txt}{space 9}Apf {c |}{res}         43    -.019937    .2690615  -.6110608   .3405317
{txt}{space 8}Apcf {c |}{res}         43    -.028264    .3814399  -.8662812   .4827608
{txt}{space 9}Aip {c |}{res}         43   -.0230385    .3109188   -.706122   .3935074
{txt}
{com}. 
. *Policy Preferences Weights
. use /data/ISSP85to06.dta, clear
{txt}
{com}. 
. preserve
{txt}
{com}. collapse  countryy govincdiff govjobs socprot year [pweight=weight], by (id)
{txt}
{com}. 
. factor govjobs govincdiff, pcf
{txt}(obs=43)

Factor analysis/correlation{col 50}Number of obs    = {res}        43
{col 5}{txt}Method: principal-component factors{col 50}Retained factors =   {res}       1
{col 5}{txt}Rotation: (unrotated){col 50}Number of params =   {res}       1

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}     Factor  {c |} {ralign 12:Eigenvalue}   Difference        Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 11:Factor1}  {c |}{res}      1.84225      1.68451            0.9211       0.9211
{txt}{col 5}{ralign 11:Factor2}  {c |}{res}      0.15775            .            0.0789       1.0000
{txt}{col 5}{hline 13}{c BT}{hline 60}
{col 5}LR test: independent vs. saturated:  chi2({res}1{txt})  ={res}   51.29{txt} Prob>chi2 ={res} 0.0000

{txt}Factor loadings (pattern matrix) and unique variances

{space 4}{hline 13}{c  TT}{hline 10}{c  TT}{hline 14}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}{c |}{space 1}{ralign 12:Uniqueness}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{c   +}{hline 14}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.9598}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.0789}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.9598}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.0789}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{c  BT}{hline 14}

{com}. predict govsAT
{txt}(regression scoring assumed)

{p 0 0 2}Scoring coefficients (method = regression){p_end}

{space 4}{hline 13}{c  TT}{hline 10}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}
{space 4}{hline 13}{c   +}{hline 10}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.52097}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.52097}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}


{com}. sum govsAT

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}govsAT {c |}{res}         43   -5.93e-09           1   -2.11652   1.317815
{txt}
{com}. egen govsR = rowmean(govincdiff govjobs)
{txt}
{com}. sort id
{txt}
{com}. 
. save /data/workingPWEIGHT.dta, replace
{txt}file /data/workingPWEIGHT.dta saved

{com}. *Policy Preferences NO Weights
. restore
{txt}
{com}. collapse  countryy govincdiff govjobs socprot year, by (id)
{txt}
{com}. factor govjobs govincdiff, pcf
{txt}(obs=43)

Factor analysis/correlation{col 50}Number of obs    = {res}        43
{col 5}{txt}Method: principal-component factors{col 50}Retained factors =   {res}       1
{col 5}{txt}Rotation: (unrotated){col 50}Number of params =   {res}       1

{txt}{col 5}{hline 13}{c TT}{hline 60}
{col 5}     Factor  {c |} {ralign 12:Eigenvalue}   Difference        Proportion   Cumulative
{col 5}{hline 13}{c +}{hline 60}
{col 5}{ralign 11:Factor1}  {c |}{res}      1.84261      1.68523            0.9213       0.9213
{txt}{col 5}{ralign 11:Factor2}  {c |}{res}      0.15739            .            0.0787       1.0000
{txt}{col 5}{hline 13}{c BT}{hline 60}
{col 5}LR test: independent vs. saturated:  chi2({res}1{txt})  ={res}   51.37{txt} Prob>chi2 ={res} 0.0000

{txt}Factor loadings (pattern matrix) and unique variances

{space 4}{hline 13}{c  TT}{hline 10}{c  TT}{hline 14}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}{c |}{space 1}{ralign 12:Uniqueness}{space 1}
{space 4}{hline 13}{c   +}{hline 10}{c   +}{hline 14}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.9598}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.0787}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  0.9598}}}{space 1}{c |}{space 1}{center 12:{res:{sf:    0.0787}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}{c  BT}{hline 14}

{com}. predict govsN
{txt}(regression scoring assumed)

{p 0 0 2}Scoring coefficients (method = regression){p_end}

{space 4}{hline 13}{c  TT}{hline 10}
{space 4}{space 0}{ralign 12:Variable}{space 1}{c |}{space 1}{ralign 8:Factor1}{space 1}
{space 4}{hline 13}{c   +}{hline 10}
{space 4}{space 0}{ralign 12:govjobs}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.52092}}}{space 1}
{space 4}{space 0}{ralign 12:govincdiff}{space 1}{c |}{space 1}{ralign 8:{res:{sf: 0.52092}}}{space 1}
{space 4}{hline 13}{c  BT}{hline 10}


{com}. sum govsN

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}govsN {c |}{res}         43   -2.08e-09           1  -2.195227   1.333364
{txt}
{com}. egen govsNR = rowmean(govincdiff govjobs)
{txt}
{com}. sort id
{txt}
{com}. 
. save /data/workingNOWEIGHT.dta, replace
{txt}file /data/workingNOWEIGHT.dta saved

{com}. 
. merge id using /Data/workingPWEIGHT.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. drop _merge
{txt}
{com}. label var govsN "Social Policy Preferences NO WEIGHTS"
{txt}
{com}. label var govsAT "Social Policy Preferences PWEIGHTS"
{txt}
{com}. label var govsR "Social Policy Preferences Org. Metric NO W"
{txt}
{com}. label var govsNR "Social Policy Preferences Org. Metric P"
{txt}
{com}. 
. save /data/working.dta, replace
{txt}file /data/working.dta saved

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\data\MISSING_MAIN\measures.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Mar 2018, 23:12:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}